'''

聚焦自己！大脑、身体！
1. 找个好工作。好好思考面试！！！
2. 写完毕业论文
3. 给岳老师成主任做完项目

每个都很重要！！
你想给晓静一个家，给自己负责，就把这三件事做好！

每天早睡早起，白天每个时刻提高效率！脑子转起来！别懈怠！ 什么都可以做！应对所有的事！！！！！

'''


'''
10/19 规划调整。

1. 我毕业要从事的方向，要吃这一波红利，把我背景、背书都做好。
背书：
1）.小米大厂实习，llm算法、llm研发、llm开发工程师。
2).下个月准备第二段实习（可以接受全职的身份，提前landing），也算是背书。
3).211硕士也应该可以拿到，一等奖也有，党员也拿到了。
4). 人工智能专业已经改过来了。
5). 人脉也有点了，保持住。
6). 证书，有获奖，也够了。
7). 但是有个问题是！我的六级没过，这个必须要过！

2. 一定要去中大厂，并且薪资base要确保。
目前面过的，小鹏（25-27）、智谱（二面挂了27）、影刀（25）.
我的目标就是找个月薪税前25k的工作。

25*14=35w，这就是我的目标。
一年到手，21*14=29.4w。加公积金肯定能到30w。（两年攒下40w）

3. 我读研的目的我快了达到了，就是提升自己的平台，换一个更好的业务方向。
后端开发->AI Network Agent智能规划推理 Agent Infra。
我笃定了这是第一波红利。第二波红利不是我导师带我了，是需要我自己开源社区和自己结交圈子朋友。
后续就是AI 智能化 + b、c、政务、制造。

4. 赶紧提升自己的能力，提升自己的理解力，把这个Agent站住。

5. 5年，我要做多少事？5年之约，这是我的一份职业人生规划，初步的人生规划。
这5年，太快了，从第一份yocoto实习到现在第二份实习，转眼间5年过来了。经历了5年了，很快就过来了，我没发现自己提升了自己，真的没有发现！！！只是选择上面整体是没错的，就够了。
现在的问题是，认清自己，啥也不是，但是自己确实确实拥有了背书。但是你不做规划，就会浑浑噩噩，没有斗志，没有理想，没有光，大脑发挥不到用处，可能是走下坡路，所以为了改变可能出现的情况，我必须决定5年后。

5年后，我要在上海站住了，成了家，养活家没问题，去遍很多地方。我不能生活和工作都混为一滩。
我要成为一个AI的专家，AI泛指了很多的 ML、DL、LLM、Agent、cuda。我都要懂。
所以，我得什么AI的项目我都得去了解，去学习，去看论文，去看新的思路，新的东西。（这就是第一，能不能再发一篇paper）(先是Agent！）
第二，AI 算法 还是 研发，都需要有工程能力，工程能力很重要的就是Coding能力，架构能力，我都归结为工程能力！！！所以我必须了解非常多的工程能力！精通业务！
第三，我要去一个能创造价值的事情，只有这样，做2c的，我才能走在崩溃的前线，能拿到期权，能做到大佬级别。这是商业的事情。
这一点，往上说是职业规划，也不是几年一跳槽，跳槽，就是一年待不下去了，那就跳，跳个5年，最后到35了，那就是35危机了。
考虑稳定，是要业务可行，能做下去，不是天坑，这是需要你有前瞻性思考，能考虑进去风险，能预知未来，才想得通！！可以以史为鉴。
第四，定位后面的职业路线，往（高级工程师）技术专家还是项目经理（项目领导）走？ 这是一把尺子！考虑成就感和你想要的收获和你的未来，那必定是项目领导！
我需要掌握的是，不是刻意的谈吐，而应该是F人转变为Thinking人！！！这是痛苦的，我必须找乐子转变过来！！！
'''